In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "Name":["Vighnesh","Suresh","Ritik","Devang"],
    "Marks":[99,78,58,65],
    "City":["Shahjahanpur","Khadharpur","Lazmi Nagar","Subhash"],
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

       Name  Marks          City
0  Vighnesh     99  Shahjahanpur
1    Suresh     78    Khadharpur
2     Ritik     58   Lazmi Nagar
3    Devang     65       Subhash

In [5]:
df.describe()

           Marks
count   4.000000
mean   75.000000
std    18.018509
min    58.000000
25%    63.250000
50%    71.500000
75%    83.250000
max    99.000000

In [6]:
df.to_csv('First-of-Pandas')

In [7]:
df.to_csv('First-of-Pandas_without_indexs', index=False )

In [8]:
Train=pd.read_csv('Train-Names.csv')

In [9]:
Train

,Unnamed: 0.2,Unnamed: 0.1,Unnamed: 0,Train Name,Train No.,City-To,City-From
0,1,1,1,Bareilly-Banaras-Express,14236,Varanasi,Bareilly
1,2,2,2,ShaktiNagar Triveni,15076,Shaktinagar,TanakPur
2,3,3,3,Bareilly-Roza,64176,Roza,Bareilly
3,4,4,4,Lucknow-Rajya Rani Superfast,22454,Lucknow,Meerut

In [10]:
Train['City-From']

0    Bareilly
1    TanakPur
2    Bareilly
3      Meerut
Name: City-From, dtype: object

In [11]:
Train["Train Name"][0]= 'Bareilly-Banaras-Express'

/tmp/ipykernel_5720/1018625119.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  Train["Train Name"][0]= 'Bareilly-Banaras-Express'
/tmp/ipykernel_5720/1018625119.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  Train["Train Name"][0]= 'Bareilly-Banaras-Express'

In [12]:
Train

,Unnamed: 0.2,Unnamed: 0.1,Unnamed: 0,Train Name,Train No.,City-To,City-From
0,1,1,1,Bareilly-Banaras-Express,14236,Varanasi,Bareilly
1,2,2,2,ShaktiNagar Triveni,15076,Shaktinagar,TanakPur
2,3,3,3,Bareilly-Roza,64176,Roza,Bareilly
3,4,4,4,Lucknow-Rajya Rani Superfast,22454,Lucknow,Meerut

In [13]:
 Train.to_csv("Train-Names.csv",index = False)

In [14]:
Train.index = [1,2,3,4]

In [15]:
Train

,Unnamed: 0.2,Unnamed: 0.1,Unnamed: 0,Train Name,Train No.,City-To,City-From
1,1,1,1,Bareilly-Banaras-Express,14236,Varanasi,Bareilly
2,2,2,2,ShaktiNagar Triveni,15076,Shaktinagar,TanakPur
3,3,3,3,Bareilly-Roza,64176,Roza,Bareilly
4,4,4,4,Lucknow-Rajya Rani Superfast,22454,Lucknow,Meerut

In [16]:
Train.to_csv("Train-Names.csv")

In [17]:
n = open("WhatisNew.csv")

FileNotFoundError: [Errno 2] No such file or directory: 'WhatisNew.csv'

In [19]:
Train.drop("City-From",axis=1,inplace=True)

In [20]:
Train["City-From"]=["Bareilly","TanakPur","Bareilly","Meerut"]

In [21]:
Train

,Unnamed: 0.2,Unnamed: 0.1,Unnamed: 0,Train Name,Train No.,City-To,City-From
1,1,1,1,Bareilly-Banaras-Express,14236,Varanasi,Bareilly
2,2,2,2,ShaktiNagar Triveni,15076,Shaktinagar,TanakPur
3,3,3,3,Bareilly-Roza,64176,Roza,Bareilly
4,4,4,4,Lucknow-Rajya Rani Superfast,22454,Lucknow,Meerut

In [22]:
Train.to_csv("Train-Names.csv",index = False)

In [23]:
Train["City-To"]=["Varanasi","Shaktinagar","Roza","Lucknow"]

In [24]:
Train

,Unnamed: 0.2,Unnamed: 0.1,Unnamed: 0,Train Name,Train No.,City-To,City-From
1,1,1,1,Bareilly-Banaras-Express,14236,Varanasi,Bareilly
2,2,2,2,ShaktiNagar Triveni,15076,Shaktinagar,TanakPur
3,3,3,3,Bareilly-Roza,64176,Roza,Bareilly
4,4,4,4,Lucknow-Rajya Rani Superfast,22454,Lucknow,Meerut

In [25]:
Train.to_csv("Train-Names.csv",index = False)

###COLLEGE

In [26]:
mydataset={
    "cars":["BMW","Volvo","Ford"],
    "Passings":[3,7,4]
}

df = pd.DataFrame(mydataset)
# df.index=[1,2,3]
df

    cars  Passings
0    BMW         3
1  Volvo         7
2   Ford         4

In [27]:
movies=pd.read_csv("imdb_Top_250_TV_Shows.csv")

In [28]:
movies.head(5)

         Shows Name Release Year Episodes  Rating Rating given by people
0      Breaking Bad    2008–2013   62 eps     9.5                 (2.2M)
1   Planet Earth II         2016    6 eps     9.5                 (163K)
2      Planet Earth         2006   11 eps     9.4                 (224K)
3  Band of Brothers         2001   10 eps     9.4                 (547K)
4         Chernobyl         2019    5 eps     9.3                 (912K)

In [29]:
movies.tail()

,Shows Name,Release Year,Episodes,Rating,Rating given by people
245,Umbre,2014–2019,21 eps,8.7,(12K)
246,Foyle's War,2002–2015,28 eps,8.6,(19K)
247,Gintama,2005–2021,375 eps,8.7,(17K)
248,The Great British Baking Show,2010–,189 eps,8.6,(13K)
249,Community,2009–2015,110 eps,8.5,(300K)

In [30]:
movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 250 entries, 0 to 249
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Shows Name              250 non-null    object
 1   Release Year            250 non-null    object
 2   Episodes                250 non-null    object
 3   Rating                  250 non-null    float64
 4   Rating given by people  250 non-null    object
dtypes: float64(1), object(4)
memory usage: 9.9+ KB

In [31]:
movies.describe()#desciptive Statistics

          Rating
count  250.00000
mean     8.75640
std      0.22365
min      8.50000
25%      8.60000
50%      8.70000
75%      8.90000
max      9.50000

In [41]:
movies.sample(5)

,Shows Name,Release Year,Episodes,Rating,Rating given by people,Random
206,Detectorists,2014–2022,20 eps,8.6,(23K),0.837545
42,True Detective,2014–,31 eps,8.9,(679K),0.534829
7,Blue Planet II,2017,7 eps,9.3,(49K),0.946491
38,Seinfeld,1989–1998,172 eps,8.9,(362K),0.311740
89,Steins;Gate,2011–2015,26 eps,8.8,(79K),0.236130

In [42]:
movies.shape()

TypeError: 'tuple' object is not callable

In [32]:
movies.iloc[0]

Shows Name                Breaking Bad
Release Year                 2008–2013
Episodes                        62 eps
Rating                             9.5
Rating given by people          (2.2M)
Name: 0, dtype: object

In [33]:
movies['Random']=np.random.rand(250)

In [34]:
movies

,Shows Name,Release Year,Episodes,Rating,Rating given by people,Random
0,Breaking Bad,2008–2013,62 eps,9.5,(2.2M),0.527807
1,Planet Earth II,2016,6 eps,9.5,(163K),0.389028
2,Planet Earth,2006,11 eps,9.4,(224K),0.176800
3,Band of Brothers,2001,10 eps,9.4,(547K),0.323879
4,Chernobyl,2019,5 eps,9.3,(912K),0.836731
...,...,...,...,...,...,...
245,Umbre,2014–2019,21 eps,8.7,(12K),0.656988
246,Foyle's War,2002–2015,28 eps,8.6,(19K),0.424435
247,Gintama,2005–2021,375 eps,8.7,(17K),0.691712
248,The Great British Baking Show,2010–,189 eps,8.6,(13K),0.334057
249,Community,2009–2015,110 eps,8.5,(300K),0.833258

In [39]:
movies.iloc[-1]

Shows Name                Community
Release Year              2009–2015
Episodes                    110 eps
Rating                          8.5
Rating given by people       (300K)
Random                     0.833258
Name: 249, dtype: object

In [47]:
movies[movies["Shows Name"].str.contains('Community')]

    Shows Name Release Year Episodes  Rating Rating given by people    Random
249  Community    2009–2015  110 eps     8.5                 (300K)  0.833258